# Дана строка. Выведите в консоль длину этой строки.
print("Напишите что угодно текстом.")
text = input()
len(text)
print(f"В слове {text} - {len(text)} букв(ы).")
