# Дано число. Проверьте, отрицательное оно или нет. Выведите об этом информацию в консоль.
print("Введите ваше число.")
thenumbah = int(input())
if thenumbah < 0:
    print(f"Число '{thenumbah}' - отрицательное.")
else:

    print(f"Число '{thenumbah}' не отрицательное.")
