# Дана строка. Выведите в консоль последний символ строки.
print("Введите слово:")
stroka = input()
print(stroka[-1])