# Дано число. Проверьте, чётное ли оно, или нет.
print("Введите число, для проверки, чётное ли оно, или нечётное.")
the_number = int(input())
if the_number % 2 == 0:
    print("Число - чётное.")
else:
    print("Числое - нечётное.")
