# Дано число. Выведите количество цифр в этом числе.
print("Впишите число. Будет выведено количество цифр в этом числе.")
number = int(input())
print (len(str(number)))