# Дан список: [1, 2, 3, 4, 5, 6]. Получите из него следующий срез: 3, 4, 5]
the_list = [1,2,3,4,5,6]
print(the_list[2:5])