# Дана строка. Если в этой строке более одного символа, выведите в консоль предпоследний символ этой строки.
print("Введите слово.")
the_word = str(input())
if len(the_word) < 1:
    print(the_word[-2])
else:
    print("легиондлялоховтгтыты лтфыво нкртопиыа")