# Дана некоторая строка. Получите список её символов.
print("Впишите слово. Вы получите список её символов.")
the_mothafuckin_word = input()
print(list(the_mothafuckin_word))
