# Выведите в консоль 4 и 5 из списка.
the_list = [1, 2, 3, 4, 5, 6]
print(the_list[4:6])