# Выведите в консоль все целые числа от 1 до 100.
for i in range(1,101):
    print(i)