# Выведите в консоль все четные числа из промежутка от 1 до 100.
for i in range(0, 102, 2):
    print(i)