# Выведите в консоль "abcde"
the_string = 'abcdeabc'
print(the_string[0:5])