# Выведите в консоль все целые числа от 100 до 1.
for i in range(100, 0, -1):
    print(i)