# Выведите в консоль все целые числа от -100 до 0.
for i in range(-100, 1):
    print(i)