# Выведите в консоль все числа кратные трем в промежутке от 1 до 100.
for i in range(0, 103, 3):
    print(i)