# Найдите сумму всех целых четных чисел в промежутке от 1 до 100.
the_sum = sum(range(1,101,2))
print(f"Сумма всех чётных чисел в промежутке от 1 до 100 : {the_sum}.")