# Дан список. Получите из него каждый второй элемент.
the_list = [1, 2, 3, 4, 5, 6]
print(the_list[1:6:2])