# Найдите сумму всех целых нечётных чисел в промежутке от 1 до 100.
the_sum = sum(range(1,101,))
print(f"Сумма всех нечётных чисел в промежутке от 1 до 100 : {the_sum}.")