# Найдите сумму всех целых чисел от 1 до 100.
the_sum = sum(range(1,101))
print(f"Сумма всех чисел в промежутке от 1 до 100: {the_sum}.")