# Дан список с числами. Найдите сумму тех элементов этого списка, которые больше нуля и меньше десяти.
this_fucking_list = [-1, 2, -3, 4, 5, 11]
sum = 0
for number in this_fucking_list:
   if number > 0 and < 10:
        sum += number

print(sum())