# Дан список с числами. Найдите сумму квадратов элементов этого списка.
the_mothafucka_list = [1, 2, 3, 4, 5]
sum_of_squares = sum(number ** 2 for number in the_mothafucka_list)
print(sum_of_squares)