# Дан список с числами. Найдите сумму элементов этого списка.
the_mothafucka_list = [1, 2, 3, 4, 5]
print(sum(the_mothafucka_list))