# Дано некоторое число. Получите список цифр этого числа.
annoying_little_shit = 12345
print(list(str(annoying_little_shit)))