# Дано некоторое число. Переверните его:
annoying_little_shit = 12345
reverse = int(str(annoying_little_shit)[::-1])
print(reverse)