# Дана строка. Получите список букв этой строки.
this_string_is_boiling_me_alive = 'abcde'
print(list(this_string_is_boiling_me_alive))