# Дано число. Выведите количество цифр в этом числе.
print("Введите число, количество цифр в котором вы хотите узнать.")
thefuckingnumber = int(input())
number = str(thefuckingnumber)
print(f"В числе '{thefuckingnumber}' - {len(number)} цифр.")